First/src/Documents/ПоступлениеТоваровИУслуг/ПоступлениеТоваровИУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровИУслуг</name>
  <registerRecords>AccumulationRegister.Товары</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчетыСКонтрагентами</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТоварыИУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

First/src/Documents/ПоступлениеТоваровИУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ТоварыИУслугиКоличествоПриИзменении(Элемент)
	ПриИзмененииКоличества(Элементы.ТоварыИУслуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиЦенаПриИзменении(Элемент)
	ПриИзмененииЦены(Элементы.ТоварыИУслуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСуммаПриИзменении(Элемент)
	ПриИзмененииСуммы(Элементы.ТоварыИУслуги.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыИУслугиСтавкаНДСПриИзменении(Элемент)
	ПриИзмененииСтавкиНДС(Элементы.ТоварыИУслуги.ТекущиеДанные);
КонецПроцедуры






&НаКлиенте
Процедура ПриИзмененииКоличества(ИзмененнаяСтрока)  
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Цена * ИзмененнаяСтрока.Количество;
	
КонецПроцедуры   

&НаКлиенте
Процедура ПриИзмененииЦены(ИзмененнаяСтрока)  
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененнаяСтрока.Сумма = ИзмененнаяСтрока.Цена * ИзмененнаяСтрока.Количество;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриИзмененииСуммы(ИзмененнаяСтрока)  
	
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриИзмененииЦены(ИзмененнаяСтрока);
	ПриИзмененииКоличества(ИзмененнаяСтрока); 
	
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	
КонецПроцедуры    


&НаКлиенте
Процедура ПриИзмененииСтавкиНДС(ИзмененнаяСтрока)  
	
	
	Если ИзмененнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененнаяСтрока.СуммаНДС = НДСКлиентСервер.СуммаНДСПоСтавке(ИзмененнаяСтрока.Сумма, ИзмененнаяСтрока.СтавкаНДС);
	
КонецПроцедуры
